app/views/albums/index.html.erb

<% @users.each do |user| %>
    <% user.albums.each do |album| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = 2 LIMIT 1