app/views/albums/show.html.erb

SELECT "images".* FROM "images" WHERE (picture_id = 9 and picture_type = 'Album' and cover_pic IS NOT NULL) LIMIT 1
---
Album images:
<% @album.images_other_than_cover.each do |image| %>