app/controllers/albums_controller.rb

  def index
    @users = User.where(:id => current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def show
    @album = Album.find(params[:id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "2"]]

  def edit
    @album = Album.find(params[:id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "13"]]

  def create
    @album = current_user.albums.build(params[:album])

    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("created_at", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 23 Apr 2014 19:41:15 UTC +00:00], ["name", "album"], ["updated_at", Wed, 23 Apr 2014 19:41:15 UTC +00:00], ["user_id", 1]]

  def update
    @album = Album.find(params[:id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "13"]]

  def destroy
    @album = Album.find(params[:id])
    @album.destroy
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 5]]

  def wall
    @users = User.all
---
SELECT "users".* FROM "users"