app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "full_name" = 'sfsf', "about_me" = '', "birthdate" = '2014-04-22', "updated_at" = '2014-04-22 06:24:53.332033' WHERE "users"."id" = 1